{
    "food": [
      {
        "id": 1,
        "name": "Poori",
        "desc": "Poori or Puri is a traditional Indian fried bread that is delicious to enjoy with almost any main dish. It’s a simple unleavened bread made from just whole wheat flour, salt, and water. Here I share my poori recipe with step-by-step photos and the best tips for making puri at home – crispy, fluffy, and soft and I bet you’ll love making homemade puri to enjoy with your favorite meals!",
        "ingredients": "Wheat flour, salt, water, oil for fry",
        "recipe": "First, mix together 3 cups whole wheat flour (360 grams), 1 teaspoon salt, and 1 teaspoon oil (optional) in a large bowl. For more crispy puri, you can add ¼ cup fine rava (sooji or semolina).Add just a bit of water at a time as you begin to form the dough, making sure to not oversaturate the mixture.Knead the dough with a wooden spoon or your hands, or use a standing mixer. Again, add only a splash or two of water at a time as you work.When ready to use, divide the dough into about 30 small or 25 medium pieces, and roll each into a tight ball. Roll tjhe ball and fry it.",
        "url": "https://cdn3.foodviva.com/static-content/food-images/roti-paratha-recipes/masala-puri-recipe/masala-puri-recipe.jpg",
        "type": "fatfree"
      },
      {
        "id": 2,
        "name": "Biriyani",
        "desc": "This Veg Biryani is an authentic Indian vegetarian recipe packed full of your favorite rice, veggies, and spices. Made with patience and lots of love, this delicious veg dum biryani requires both care and attention to detail. The savory flavors in your first bite are well worth the time and effort spent in the kitchen.",
        "ingredients": "Rice, onions, tomatoes, vegetables,oil,salt,garam masala, ginger garlic paste, paneer,coriander leaves, Mint leaves",
        "recipe": "firstly, in a large kadai heat 1 tbsp ghee and saute 1 bay leaf, 1 inch cinnamon, 1 star, ¼ tsp shah jeera till turns aromatic.further add 1 onion and saute well. also add ½ tsp ginger garlic paste and continue to saute.now add ½ carrot, ¼ potato, ¼ capsicum, 8 florets gobi and 3 beans.saute well making sure the vegetables are cooked well.furthermore add ¼ cup curd, ½ tsp chilli powder, 1 tsp biryani masala powder and ½ tsp salt.saute well making sure the spices and curd are cooked well. and also oil releases from sides.now add 2 tbsp pudina and 2 tbsp coriander leaves.further add 2 cups of cooked basmati rice and mix gently.mix well making sure the rice grain doesn't break, finally, instant veg biryani is ready to serve along with onion-tomato raita.",
        "url": "https://www.indianhealthyrecipes.com/wp-content/uploads/2019/04/veg-biryani-recipe.jpg",
        "type": "Vegan"
      },
      {
        "id": 3,
        "name": "Pasta",
        "desc": "Pasta is an Italian Dish",
        "ingredients": "Pasta, cream",
        "recipe": "Boil pasta",
        "url": "https://www.saltandlavender.com/wp-content/uploads/2020/04/tomato-goat-cheese-pasta-recipe-1-500x500.jpg",
        "type": "fatfree"
      },
      {
        "id": 4,
        "name": "GheeRice",
        "desc": "Its my kids faviorite recipe",
        "ingredients": "Rice, ghee, cumin seeds, salt",
        "recipe": "Boil Rice",
        "url":"https://www.vegrecipesofindia.com/wp-content/uploads/2021/02/ghee-rice-recipe-1-500x375.jpg",
        "type": "Vegan"
      }
    ]
  }